In [1]:
import pandas as pd

file = pd.ExcelFile("sales.xlsx")
print(file.sheet_names)

['sales', 'customers']

In [2]:
sheet = file.parse('sales')
sheet

        Date             Customer  Invoice  Amount
0 2018-12-01  Steel Brothers Inc.       98    1340
1 2018-12-10             MMC Inc.       99    1900
2 2018-12-12             MMC Inc.      100    2900
3 2018-12-18  Steel Brothers Inc.      101     977
4 2018-12-21     Steel & Iron LLC      102    3400

In [3]:
type(sheet)

pandas.core.frame.DataFrame

In [4]:
sheet.Date

0   2018-12-01
1   2018-12-10
2   2018-12-12
3   2018-12-18
4   2018-12-21
Name: Date, dtype: datetime64[ns]

In [5]:
sheet.Amount.sum()

10517

In [6]:
sheet.loc[0]

Date        2018-12-01 00:00:00
Customer    Steel Brothers Inc.
Invoice                      98
Amount                     1340
Name: 0, dtype: object

In [7]:
sheet.loc[0, 'Amount']

1340

In [8]:
sheet.set_index('Customer', inplace = True)
sheet.loc['MMC Inc.']

               Date  Invoice  Amount
Customer
MMC Inc. 2018-12-10       99    1900
MMC Inc. 2018-12-12      100    2900

In [9]:
sheet = sheet.reset_index()
sheet['Invoice']

0     98
1     99
2    100
3    101
4    102
Name: Invoice, dtype: int64

In [10]:
type(sheet['Invoice'])

pandas.core.series.Series

In [11]:
sheet.loc[sheet['Invoice'] == 99]

   Customer       Date  Invoice  Amount
1  MMC Inc. 2018-12-10       99    1900

In [12]:
sheet.loc[sheet['Amount'] > 2000]

           Customer       Date  Invoice  Amount
2          MMC Inc. 2018-12-12      100    2900
4  Steel & Iron LLC 2018-12-21      102    3400

In [13]:
sheet.loc[sheet['Amount'].idxmax()]

Customer       Steel & Iron LLC
Date        2018-12-21 00:00:00
Invoice                     102
Amount                     3400
Name: 4, dtype: object

In [14]:
sheet.loc[sheet['Amount'].idxmax()]['Customer']

'Steel & Iron LLC'

In [17]:
sheet.loc[sheet['Amount'] > 1800]['Customer']

1            MMC Inc.
2            MMC Inc.
4    Steel & Iron LLC
Name: Customer, dtype: object

In [18]:
sheet.loc[sheet['Amount'] > 1800]['Customer'].unique()

array(['MMC Inc.', 'Steel & Iron LLC'], dtype=object)

In [19]:
sheet.loc[sheet['Amount'] > 1800]['Customer'].unique()[0]

'MMC Inc.'

In [20]:
for customer in sheet.loc[sheet['Amount'] > 1800]['Customer'].unique() :
    print(customer)

MMC Inc.
Steel & Iron LLC